teaching/411-fall-25/411-fall-25.tex
% Created 2025-07-31 Thu 15:18
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Santiago Arango Piñeros}
\date{\today}
\title{Math 411 - Fall 2025}
\hypersetup{
 pdfauthor={Santiago Arango Piñeros},
 pdftitle={Math 411 - Fall 2025},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.3 (Org mode 9.6.15)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Coordinates}
\label{sec:orga39e2ff}
\subsection{Instructor}
\label{sec:orgc0dc398}
\href{https://sarangop1728.github.io/}{Santiago Arango Piñeros} (he/him/his).
My office is LGRT 1111, and you can contact me by email at:
\begin{itemize}
\item \texttt{sarangopiner@umass.edu}.
\end{itemize}
\subsection{Office hours}
\label{sec:orga330084}
\begin{itemize}
\item Between 1 PM to 3 PM on Tuesdays and Thursdays. (Location TBD)
\item If the above time is not convenient, send me an email.
\end{itemize}

\section{Philosophy}
\label{sec:orgec92315}
\subsection{Learning is the student's responsibility}
\label{sec:orge8fa670}
Paraphrasing Galileo:
\begin{quote}
``You cannot teach a person \textbf{anything}; you can only help
them find it within themselves.''
\end{quote}
We are all here to \uline{understand}. My job as a
more experienced learner is to assist you on your journey. But you have to
invest time and effort to actually learn.
\subsection{Doing hard things}
\label{sec:orgc8534be}
This is hard work, and it will be frustrating at times. In my opinion, the
reward is well worth the investment, as it is often the case with challenging
endeavors. In the words of JFK:
\begin{quote}
``We choose to go to the Moon in this decade and do the other things, not
because they are easy, but because they are hard; because that goal will serve
to organize and measure the best of our energies and skills, because that
challenge is one that we are willing to accept, one we are unwilling to
postpone, and one we intend to win, and the others, too.''
\end{quote}

\subsection{Everyone belongs in this classroom}
\label{sec:orgc43060b}
We will subscribe to \href{https://www.ams.org/publications/journals/notices/201610/rnoti-p1164.pdf}{Federico's axioms}.

\begin{itemize}
\item \textbf{Axiom 1.} Mathematical potential is equally present in different groups,
irrespective of geographic, demographic, and economic boundaries.

\item \textbf{Axiom 2.} Everyone can have joyful, meaningful, and empowering mathematical
experiences.

\item \textbf{Axiom 3.} Mathematics is a powerful, malleable tool that can be shaped and
used differently by various communities to serve their needs.

\item \textbf{Axiom 4.} Every student deserves to be treated with dignity and respect.
\end{itemize}

\section{Course description}
\label{sec:org60393f2}
The focus of the course will be on studying \emph{groups}. These are algebraic
structures that capture the notion of symmetry. Groups are ubiquitous in all
areas of mathematics (and the world around us). If you commit to this class,
you will master the essential concepts of group theory by the end of the
course.
\subsection{Prerequisites}
\label{sec:orgee9b4ad}
\textbf{MATH 235} and either \textbf{CMPSCI 250} or \textbf{MATH 300}. In other words, we will need some
important concepts from linear algebra, and there will be an emphasis on proofs
and development of careful mathematical reasoning and writing.

\subsection{Textbook}
\label{sec:orgb516002}
\begin{itemize}
\item \textbf{\emph{Algebra: Abstract and Concrete}} by Frederick M. Goodman. The book is
freely available for download at the \href{https://homepage.divms.uiowa.edu/\~goodman/algebrabook.dir/algebrabook.html}{author's web-site}.
\item As a complement of the textbook, we will use some of \href{https://kconrad.math.uconn.edu/blurbs/}{Keith Conrad's blurbs} on
group theory.
\end{itemize}

\subsection{Learning objectives}
\label{sec:orgeb96ddc}

\begin{enumerate}
\item To learn the fundamental examples of groups: finitely generated abelian
groups, dihedral groups, symmetric and alternating groups, and matrix
groups.
\item To learn the axiomatic definition of a group and how to use it to prove
basic properties.
\item To learn the concepts of subgroups, cosets, quotients, and how to combine
these to derive Lagrange’s theorem.
\item To learn the concepts of homomorphisms and isomorphisms and Noether's
isomorphism theorems.
\item To understand the structure theorem of finitely generated abelian groups in
terms of the Smith normal form of a matrix with integer coefficients.
\item To learn what it means for a group to act on a set as well as the
natural actions of each of the fundamental examples.
\end{enumerate}

\subsection{Homework (\texttt{35 points})}
\label{sec:orge5b883d}
Homework assignments must be submitted through Canvas by \texttt{11:59 PM} on the due
date. Each problem set contains 5 problems, and each problem is worth \texttt{1 point}.
\begin{itemize}
\item \texttt{PSET1}: Some examples of groups (\texttt{pdf})(\texttt{tex}) \textit{<2025-09-11 Thu>}.
\item \texttt{PSET2}: Basic properties of groups (\texttt{pdf})(\texttt{tex}) \textit{<2025-09-25 Thu>}.
\item \texttt{PSET3}: Lagrange's theorem (\texttt{pdf})(\texttt{tex}) \textit{<2025-10-07 Tue>}.
\item \texttt{PSET4}: The isomorphism theorems (\texttt{pdf})(\texttt{tex}) \textit{<2025-10-16 Thu>}.
\item \texttt{PSET5}: Finitely generated abelian groups (\texttt{pdf})(\texttt{tex}) \textit{<2025-11-06 Thu>}.
\item \texttt{PSET6}: Symmetries of regular polyhedra (\texttt{pdf})(\texttt{tex}) \textit{<2025-11-18 Tue>}.
\item \texttt{PSET7}: Group actions (\texttt{pdf})(\texttt{tex}) \textit{<2025-12-09 Tue>}.
\end{itemize}

\subsection{Exams (\texttt{72 points})}
\label{sec:orgc2ab170}
There will be three exams. Each exam will have 6 questions. Each question will
be worth \texttt{4 points}.
\begin{itemize}
\item \texttt{EXAM1}: Lectures 1-7. \textit{<2025-09-25 Thu>}
\item \texttt{EXAM2}: Lectures 8-14. \textit{<2025-11-06 Thu>}
\item \texttt{EXAM3}: Lectures 18-22. \textit{<2025-12-09 Tue>}
\end{itemize}
Question one will ask you to define a concept. Question two will ask you to
prove a result (of reasonable difficulty) from the assigned reading. Questions
3, 4, and 5 will be random problems related to the topics of the lectures.
\subsection{Final exam}
\label{sec:org0129372}
The final exam is not a final exam. Instead, it is an opportunity for you to
learn from your mistakes. For each one of the homework problems or exam
questions that you previously got wrong, you will have the chance to:
\begin{enumerate}
\item Explain what was your mistake.
\item Write down a correct solution to the problem/question.
\end{enumerate}
If you successfully do this, you will earn the points for that problem/question.
Note that you may not present a problem that you did not turn in before. Keep
in mind that taking the final exam is optional, and students with a perfect
score (\texttt{107 points}) have no reason to take it.

Some remarks:
\begin{itemize}
\item It is likely that you won't have time to solve more than 8 questions during
the final exam.
\item Since one exam question is worth four times one homework problem, it makes
sense to prioritize the former.
\end{itemize}
\subsection{Grades}
\label{sec:orga8b3ca5}
The grade of the class will be calculated by adding the total number of points
obtained after the final exam.
\begin{center}
\begin{tabular}{llllll}
\textbf{Grade} & A & A\(-\) & B\(+\) & B & B\(-\)\\[0pt]
\hline
\texttt{points} & \(\geq 100\) & \(\geq 95\) & \(\geq 90\) & \(\geq 85\) & \(\geq 80\)\\[0pt]
\end{tabular}
\end{center}


\begin{center}
\begin{tabular}{lllllll}
\textbf{Grade} & C\(+\) & C & C\(-\) & D\(+\) & D & F\\[0pt]
\hline
\texttt{points} & \(\geq 75\) & \(\geq70\) & \(\geq65\) & \(\geq 60\) & \(\geq 55\) & \(< 55\)\\[0pt]
\end{tabular}
\end{center}

\section{Topics and schedule}
\label{sec:org822d4f7}
It is the student's responsibility to read the material before the lecture.
During the lectures, we will focus on reviewing the key concepts, answering
questions, and working on examples.


\begin{center}
\begin{tabular}{llr}
\hline
Date & Lecture & Reading\\[0pt]
\hline
\textit{<2025-09-02 Tue>} & 1. What is symmetry? & 1.1 - 1.7\\[0pt]
\textit{<2025-09-04 Thu>} & 2. Examples of groups & 1.1 - 1.7\\[0pt]
\textit{<2025-09-09 Tue>} & 3. Abstract groups: first results & 1.10, 2.1\\[0pt]
\textit{<2025-09-11 Thu>} & 4. Subgroups and cyclic groups & 2.2\\[0pt]
\textit{<2025-09-16 Tue>} & 5. Dihedral groups & 2.3\\[0pt]
\textit{<2025-09-18 Thu>} & 6. Homomorphisms and isomorphisms & 2.4\\[0pt]
\textit{<2025-09-23 Tue>} & 7. The sign of a permutation & \href{https://kconrad.math.uconn.edu/blurbs/grouptheory/sign.pdf}{Blurb}\\[0pt]
\textit{<2025-09-25 Thu>} & \textbf{Exam 1} & \\[0pt]
\textit{<2025-09-30 Tue>} & 8. Cosets & 2.5\\[0pt]
\textit{<2025-10-02 Thu>} & 9. Lagrange's theorem & 2.5\\[0pt]
\textit{<2025-10-07 Tue>} & 10. \href{https://en.wikipedia.org/wiki/Emmy\_Noether}{Noether's} isomorphism theorems & 2.7\\[0pt]
\textit{<2025-10-09 Thu>} & 11. Direct products & 3.1\\[0pt]
\textit{<2025-10-14 Tue>} & 12. Semidirect products & 3.2\\[0pt]
\textit{<2025-10-16 Thu>} & 13. Linear algebra over the integers & 3.5\\[0pt]
\textit{<2025-10-21 Tue>} & 14. Finitely generated abelian groups & 3.6\\[0pt]
\textit{<2025-10-23 Thu>} & 15. Rotations of regular polyhedra & 4.1\\[0pt]
\textit{<2025-10-28 Tue>} & 16. The Dodecahedron and Icosahedron & 4.2\\[0pt]
\textit{<2025-10-30 Thu>} & 17. Reflections & 4.3\\[0pt]
\textit{<2025-11-04 Tue>} & \textbf{No class} (election day) & \\[0pt]
\textit{<2025-11-06 Thu>} & \textbf{Exam 2} & \\[0pt]
\textit{<2025-11-11 Tue>} & \textbf{No class} (veterans day) & \\[0pt]
\textit{<2025-11-13 Thu>} & 18. Group actions & 5.1\\[0pt]
\textit{<2025-11-18 Tue>} & 19. Counting orbits & 5.2\\[0pt]
\textit{<2025-11-20 Thu>} & 20. Symmetries of groups & 5.3\\[0pt]
\textit{<2025-11-25 Tue>} & 21. Group actions and group structure & 5.4\\[0pt]
\textit{<2025-11-27 Thu>} & \textbf{No class} (thanksgiving) & \\[0pt]
\textit{<2025-12-02 Tue>} & 22. The Sylow theorems & \href{https://kconrad.math.uconn.edu/blurbs/grouptheory/sylowpf.pdf}{Blurb}\\[0pt]
\textit{<2025-12-04 Thu>} & 23. Questions? & \\[0pt]
\textit{<2025-12-09 Tue>} & \textbf{Exam 3} & \\[0pt]
\hline
\end{tabular}
\end{center}


\section{Accommodation Statement}
\label{sec:orgf68de26}

The University of Massachusetts Amherst is committed to providing an equal
educational opportunity for all students. If you have a documented physical,
psychological, or learning disability on file with Disability Services (DS),
you may be eligible for reasonable academic accommodations to help you succeed
in this course. If you have a documented disability that requires an
accommodation, please notify me within the first two weeks of the semester so
that we may make appropriate arrangements.

\section{Academic Honesty Statement}
\label{sec:org5f5f8e2}

The Academic Honesty Policy was established to ensure that the learning
environment at the university is honest and fair. The policy is designed to
provide faculty and students with options for handling incidents.

Academic dishonesty includes but is not limited to:

\begin{itemize}
\item \textbf{Cheating} — intentional use or attempted use of trickery or deception in one’s academic work
\item \textbf{Fabrication} — intentional falsification and/or invention of any information or citation
\item \textbf{Plagiarism} — knowingly representing the words or ideas of another as one’s own work
\item \textbf{Facilitating dishonesty} — knowingly helping or attempting to help another commit an act of academic dishonesty
\end{itemize}

The Academic Honesty Board handles all cases of academic dishonesty on campus.
Formal definitions of academic dishonesty, examples of various forms of
dishonesty, and the procedures which faculty must follow to penalize dishonesty
are contained in the Academic Honesty Policy. There are two main pathways for
resolving cases where dishonesty is suspected: the informal resolution and the
formal charge. Both these paths require that the faculty member first inform
the student of the concern and offer a meeting. For more information:
\url{http://www.umass.edu/honesty/}.
\end{document}
